Update Docs
move ascii to mermaid
